var totalData=[
    {name:"今日预购商品量",count:95464},
    {name:"今日直供商品量",count:54},
    {name:"今日预定销售量",count:953},
    {name:"电商平台客户量",count:241}
    ];


    var fix_xian={
    	//说明: 县名+ 位置修正: offset 表沿x,y轴偏移,position: 县名显示位置: left 左,top 上,right 右,bottom 下.
    	'修文' : { normal: { offset: [0,0],position: 'left',}},
    	'玉屏' : { normal: { offset: [0,0],position: 'top',}},
    	'岑巩' : { normal: { offset: [0,0],position: 'left',}},
    	'万山' : { normal: { offset: [0,0],position: 'top',}},

};
         
    

    var geoCoordMap = {
    "贵阳市":[106.6992,26.7682],
    "安顺市":[105.9082,25.9882],
    "六盘水市":[104.7546,26.0925],
    "黔西南州":[105.5347,25.3949],
    "铜仁市":[108.6218,28.0096],
    "黔南州":[107.2485,25.8398],
    "毕节市":[105.1611,27.0648],
    "黔东南州":[108.4241,26.4166],
    "遵义市":[106.908,28.1744],

    //贵阳
    "开阳":[106.97,27.07],
    "息烽":[106.73,27.1],  
    "修文":[106.58,26.83],  
    "清镇市":[106.47,26.55],
    //六盘水市
//    "钟山区":[104.83,26.6],
    "六枝":[104.83,26.6],
    "水城":[105.48,26.22],
    "盘县":[104.47,25.72],
    //遵义市
    "遵义":[106.83,27.53],
    "桐梓":[106.82,28.13],
    "绥阳":[107.18,27.95],
    "正安":[107.43,28.55],
    "道真":[107.6,28.88],
    "务川":[107.88,28.53],
    "凤冈":[107.72,27.97], 
    "湄潭":[107.48,27.77], 
    "余庆":[107.88,27.22], 
    "习水":[106.22,28.32], 
    "赤水市":[105.7,28.58], 
    "仁怀市":[106.42,27.82], 
    //安顺市
    "平坝":[106.25,26.42], 
    "普定":[105.75,26.32], 
    "镇宁":[105.77,26.07], 
    "关岭":[105.62,25.95], 
    "紫云":[106.08,25.75], 
    //铜仁地区
    "江口":[108.85,27.7], 
    "玉屏":[108.92,27.23],   
    "石阡":[108.23,27.52], 
    "思南":[108.25,27.93],  
    "印江":[108.4,28.0], 
    "德江":[108.12,28.27],  
    "沿河":[108.5,28.57], 
    "松桃":[109.2,28.17],  
    "万山":[109.2,27.52], 
     //兴义市
    "兴仁":[105.18,25.43], 
    "普安":[104.95,25.78], 
    "晴隆":[105.22,25.83],   
    "贞丰":[105.65,25.38], 
    "望谟":[106.1,25.17],   
    "册亨":[105.82,24.98], 
    "安龙":[105.47,25.12], 
    //毕节地区
    "大方":[105.6,27.15], 
    "黔西":[106.03,27.03],
    "金沙":[106.22,27.47], 
    "织金":[105.77,26.67],
    "纳雍":[105.38,26.78], 
    "赫章":[104.72,27.13],
    //黔东南
    "凯里市":[107.97,26.58], 
    "黄平":[107.9,26.9],
    "施秉":[108.12,27.03], 
    "三穗":[108.68,26.97],
    "镇远":[108.42,27.05], 
    "岑巩":[108.82,27.18],
    "天柱":[109.2,26.92], 
    "锦屏":[109.2,26.68],
    "剑河":[108.45,26.73], 
    "台江":[108.32,26.67],
    "黎平":[109.13,26.23], 
    "榕江":[108.52,25.93],
    "从江":[108.9,25.75],
    "雷山":[108.07,26.38],
    "麻江":[107.58,26.5], 
    "丹寨":[107.8,26.2],

// 黔南布依族苗族自治州
    "都匀市":[107.52,26.27],
    "福泉市":[107.5,26.7],
    "荔波":[107.88,25.42],
    "贵定":[107.23,26.58],
    "瓮安":[107.47,27.07],
    "独山":[107.53,25.83],
    "平塘":[107.32,25.83],
    "罗甸":[106.75,25.43],
    "长顺":[106.45,26.03],
    "龙里":[106.97,26.45],
    "惠水":[106.65,26.13],
    "三都":[107.87,25.98]  
};





var sp_region_default=[    //默认颜色
 {  name: '贵阳市',itemStyle: { 
    normal: { areaColor: '#f9d3e3'}  
             }
            },
             {
             name: '安顺市',
             itemStyle: {
             normal: { areaColor: '#d7e8ba'} 
             }
             },
             {
             name: '六盘水市',
             itemStyle: {
              normal: { areaColor: '#bbd5ef'} 
             }
             },
             {
             name: '遵义市',
             itemStyle: {
              normal: { areaColor: '#d7e8ba'} 
             }
             },
             {
             name: '毕节市',
             itemStyle: {
              normal: { areaColor: '#fff2ad'} 
             }
             },
             {
             name: '黔西南州',
             itemStyle: {
             normal: { areaColor: '#f9d3e3'} 
             }
             },
             {
             name: '铜仁市',
             itemStyle: {
             normal: { areaColor: '#f9d3e3'}  
             }
             },
            {
             name: '黔东南州',
             itemStyle: {
             normal: { areaColor: '#bbd5ef'}
              
             }},
            {
                name: '黔南州',
                itemStyle: {
                   normal: {areaColor: '#fce5e4'} 
                }
            }
]; 
var sp_region_2=[   //2# 颜色
 {  name: '贵阳市',itemStyle: {  
    normal: { areaColor: '#8CD6A3'}
             }
            },
             {
             name: '安顺市',
             itemStyle: { 
              normal: { areaColor: '#40BB6B'}
             }
             },
             {
             name: '六盘水市',
             itemStyle: { 
              normal: { areaColor: '#2A915A'}
             }
             },
             {
             name: '遵义市',
             itemStyle: { 
              normal: { areaColor: '#40BB6B'}
             }
             },
             {
             name: '毕节市',
             itemStyle: { 
              normal: { areaColor: '#2A915A'}
             }
             },
             {
             name: '黔西南州',
             itemStyle: { 
              normal: { areaColor: '#66C875'}
             }
             },
             {
             name: '铜仁市',
             itemStyle: { 
              normal: { areaColor: '#2A915A'}
             }
             },
            {
             name: '黔东南州',
             itemStyle: { 
              normal: { areaColor: '#2A915A'}
             }},
            {
                name: '黔南州',
                itemStyle: { 
                     normal: { areaColor: '#66C875'}
                }
            }
];

var sp_region_3=[   //3# 颜色
 {  name: '贵阳市',itemStyle: {  
    normal: { areaColor: '#8EBF2F'}
             }
            },
             {
             name: '安顺市',
             itemStyle: { 
              normal: { areaColor: '#227652  '}
             }
             },
             {
             name: '六盘水市',
             itemStyle: { 
              normal: { areaColor: '#09684f '}
             }
             },
             {
             name: '遵义市',
             itemStyle: { 
              normal: { areaColor: '#227652  '}
             }
             },
             {
             name: '毕节市',
             itemStyle: { 
              normal: { areaColor: '#2CA36F '}
             }
             },
             {
             name: '黔西南州',
             itemStyle: { 
              normal: { areaColor: '# '}
             }
             },
             {
             name: '铜仁市',
             itemStyle: { 
              normal: { areaColor: '#0F8680  '}
             }
             },
            {
             name: '黔东南州',
             itemStyle: { 
              normal: { areaColor: '#    '}
             }},
            {
                name: '黔南州',
                itemStyle: { 
                     normal: { areaColor: '#2CA36F '}
                }
            }
];

var sp_region=sp_region_3; //地州配色